app/controllers/bookings_controller.rb

  def index
    @bookings = Booking.all
---
SELECT "bookings".* FROM "bookings"

    def set_booking
      @booking = Booking.find(params[:id])
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]