app/controllers/search_controller.rb

SELECT "amenities".* FROM "amenities" INNER JOIN "locations" ON "locations"."id" = "amenities"."location_id" WHERE "amenities"."toilet" = $1 AND (locations.suburb like '%Syd%' AND locations.street like '%Market%')  [["toilet", 1]]
SELECT "locations".* FROM "locations" INNER JOIN "amenities" ON "amenities"."location_id" = "locations"."id" WHERE "locations"."suburb" = $1 AND (amenities.toilet = 1)  [["suburb", "Sydney"]]
---
  def index
    # @amenities = Amenity.all
    if(params['toilet'].present?)
      @amenities = Location.where(:suburb => 'Sydney').joins(:amenities).where('amenities.toilet = 1')