app/controllers/search_controller.rb

  def index
    # @amenities = Amenity.all
    if(params['toilet'].present?)
      @amenities = Amenity.joins(location: :user).uniq
---
SELECT "amenities".* FROM "amenities" INNER JOIN "locations" ON "locations"."id" = "amenities"."location_id" INNER JOIN "users" ON "users"."id" = "locations"."user_id"